# SpecificHeatOfVaporization Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ThermalAsset..::..SpecificHeatOfVaporization Property
ThermalAsset Class See Also
---
The specific heat of vaporization of the asset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double SpecificHeatOfVaporization { get; set; }
```

Visual Basic
---
```text
Public Property SpecificHeatOfVaporization As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double SpecificHeatOfVaporization {
	double get ();
	void set (double value);
}
```

# Remarks
Values are in feet per squared-second (ft/s²) and must be non-negative.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for specificHeatOfVaporization must be non-negative. |

# See Also
ThermalAsset Class
Autodesk.Revit.DB Namespace